In [5]:
import numpy as np 
import pandas as pd

In [51]:
pd.read_json('train.json').head()

      id      cuisine                                        ingredients
0  10259        greek  [romaine lettuce, black olives, grape tomatoes...
1  25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2  20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3  22213       indian                [water, vegetable oil, wheat, salt]
4  13162       indian  [black pepper, shallots, cornflour, cayenne pe...

# read json from link(https://api.exchangerate-api.com/v4/latest/INR)

In [52]:
pd.read_json('https://api.exchangerate-api.com/v4/latest/INR').head()

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
INR,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-08-09,1754697601,1.0000
AED,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-08-09,1754697601,0.0419
AFN,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-08-09,1754697601,0.7840
ALL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-08-09,1754697601,0.9520
AMD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-08-09,1754697601,4.3800

# working SQL file

In [53]:
!pip install mysql.connector

Requirement already satisfied: mysql.connector in c:\users\md manzar\anaconda3\lib\site-packages (2.2.9)

In [2]:
import mysql.connector

In [4]:
conn=mysql.connector.connect(host='localhost',user='root',password='',database='world')

In [7]:
pd.read_sql_query('select * from city',conn)

C:\Users\MD MANZAR\AppData\Local\Temp\ipykernel_15056\1806405581.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('select * from city',conn)

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [23]:
pd.read_sql_query('SELECT Name, District FROM city ORDER BY Name ASC',conn).head()

C:\Users\MD MANZAR\AppData\Local\Temp\ipykernel_15056\488661718.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('SELECT Name, District FROM city ORDER BY Name ASC',conn).head()

                   Name             District
0  A Coruña (La Coruña)              Galicia
1                Aachen  Nordrhein-Westfalen
2               Aalborg          Nordjylland
3                   Aba           Imo & Abia
4                Abadan            Khuzestan

# due to warning change in code syntax 
from--> conn=mysql.connector.connect(host='localhost',user='root',password='',database='world')%%!

In [29]:
#new syntax 
from sqlalchemy import create_engine
engine = create_engine("mysql+mysqlconnector://root:@localhost/world")

In [43]:
df = pd.read_sql_query("SELECT * FROM city", engine)
print(df.head())

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [24]:
df2=pd.read_sql_query("SELECT * FROM country", engine)
print(df.head())

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [25]:
df3=pd.read_sql_query("SELECT * FROM countrylanguage", engine)
print(df.head())

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [26]:
df.shape

(4079, 5)

In [27]:
df2.shape

(239, 15)

In [28]:
df3.shape

(984, 4)

In [39]:
#ID	Name	CountryCode	District	Population
df.head(1)

   ID   Name CountryCode District  Population
0   1  Kabul         AFG    Kabol     1780000

In [38]:
#Code	Name	Continent	Region	SurfaceArea	IndepYear	Population	LifeExpectancy	GNP	GNPOld	LocalName	GovernmentForm	HeadOfState	Capital	Code2
df2.head(1)

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW